Revit 2027 API
RebarContainer.GetParametersManager Method
 Returns an object used to manage parameters of the Rebar Container.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarContainerParameterManager GetParametersManager()
Public Function GetParametersManager As RebarContainerParameterManager
public:
RebarContainerParameterManager^ GetParametersManager()
member GetParametersManager : unit -> RebarContainerParameterManager
Return Value
RebarContainerParameterManager
 The parameters manager.
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace